In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("sample_data.csv")

In [10]:
data.head()

,Name,Email,Phone,Address,City,Country,Date of Birth,Salary
0,Lisa West,andrew23@example.com,(465)852-8470,Unit 5183 Box 8914\nDPO AP 26775,Perezfort,Honduras,2001-08-05,83302.0
1,Jason Cole,kenneth05@example.net,7783540568,73784 Kenneth Stream Apt. 200\nFitzgeraldshire...,Port Andrea,Bolivia,2012-12-04,31035.0
2,Juan Crosby,zbarnes@example.org,(676)328-6244x05295,"0580 Mary Row\nLake Vanessabury, GA 81529",Johnborough,South Africa,1921-02-02,60226.0
3,April Ball,michaelmckinney@example.com,+1-633-685-4901x2113,"6215 Hensley Pass Apt. 136\nSouth Patricia, MN...",New Eric,Greece,2023-05-08,52502.0
4,Donald Jackson,peterdean@example.com,779-437-7643,"156 Macdonald Alley\nWest Scottmouth, MA 82872",Alyssaborough,Namibia,2019-03-07,38687.0

In [11]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
185    False
186    False
187    False
188    False
189    False
Length: 172, dtype: bool

In [7]:
data.drop_duplicates(inplace=True)

In [8]:
data.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
185    False
186    False
187    False
188    False
189    False
Length: 172, dtype: bool

In [13]:
data.dropna(inplace=True)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 165 entries, 0 to 189
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           165 non-null    object
 1   Email          165 non-null    object
 2   Phone          165 non-null    object
 3   Address        165 non-null    object
 4   City           165 non-null    object
 5   Country        165 non-null    object
 6   Date of Birth  165 non-null    object
 7   Salary         165 non-null    float64
dtypes: float64(1), object(7)
memory usage: 11.6+ KB